Table of Contents
 Class Segment3D
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Represents a segment in three-dimensional space.
public abstract class Segment3D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Segment3D
Derived
ArcSegment3D
LineSegment3D
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 EndPoint
Gets or sets the reference to Point3D endpoint of the segment.
public ReferenceElement EndPoint { get; set; }
Property Value
ReferenceElement
 LocalCoordinateSystem
Local coordinate system
public CoordSystem LocalCoordinateSystem { get; set; }
Property Value
CoordSystem
 StartPoint
Gets or sets the reference to Point3D startpoint of the segment.
public ReferenceElement StartPoint { get; set; }
Property Value
ReferenceElement
 Edit this page